<?php

// 紀錄：
// 1827 之後還沒看
// 1770 ~ 1761 之間還沒看
return [
    1935 => [
        'title' => '2018',
        'caption' => '我們應該早點開始算的，但是一直到十二月底我們都還在算耶誕節會落在哪一天。',
        'height' => 263,
        'transcript' => '
女：不知道 2018 是不是閏年
男：…不是吧？
女：現在還很難說
男：一定不是吧，閏年可以被4整除。
女：確實是，而且對奇數來說這很簡單。不過 2018 是偶數，機會是一半一半。
男：我可以用計算機確認這件事
女：不可能。如果大數字這麼容易因數分解，現代密碼學就垮了
男：我懂了
女：我只希望我們能在二月之前靠暴力法算出來

{{我們應該早點開始算的，但是一直到十二月底我們都還在算耶誕節會落在哪一天。}}',
        'date' => '2017-12-29',
    ],
    1931 => [
        'title' => '虛擬助手',
        'caption' => '如果你想要關掉這個功能，他會一直道歉並且保證下次會安靜一點。下一次會播放音量比較低的版本，而在發出音量大的聲音之後還會加一句「抱歉」。',
        'height' => 655,
        'date' => '2017-12-20',
    ],
    1889 => [
        'title' => 'XKCD Phone 6',
        'caption' => '我們理解您在意隱私，我們保證不會傳輸或儲存您的臉部照片。',
        'height' => 626,
        'date' => '2017-9-13',
    ],
    1858 => [
        'title' => '七月四日',
        'caption' => '奇怪的是，他們還是會吃熱狗慶祝。由於他們沒有嘴，所以就只是把熱狗往天上丟然後掉到葉片裡面，弄的髒髒的。',
        'height' => 308,
        'date' => '2017-7-3',
    ],
    1838 => [
        'title' => '機器學習',
        'caption' => '這堆東西泡資料泡久了以後會變得軟軟的，所以技術上來說這是個遞歸系統。',
        'height' => 438,
        'date' => '2017-5-17',
    ],
    1836 => [
        'title' => 'Okeanos',
        'caption' => '我在那艘船上的時候手機掉到海裡了，你能幫我找一下嗎？',
        'height' => 414,
        'date' => '2017-5-12',
    ],
    1833 => [
        'title' => '程式碼品質之三',
        'caption' => '看起來像是解到一半的 cryptogram，內容是不會寫 FORTH 的人寫出來的 FORTH 程式碼。',
        'height' => 259,
        'date' => '2017-5-5',
    ],
    1832 => [
        'title' => '照片管理',
        'caption' => '有一招是用兩光兩光的爛機器來管照片。這樣每隔五年之類的他就會爛掉，然後你就被迫得拆開他，拯救那些你最喜歡的照片。',
        'height' => 454,
        'date' => '2017-5-3',
    ],
    1827 => [
        'title' => '生存者偏差',
        'caption' => '他們會說結果就能代表一切，但這是哪門子的失敗主義論點？如果同意這說法，那什麼鬼東西都能同意了。',
        'height' => 470,
        'date' => '2017-4-21',
    ],
    1825 => [
        'title' => '7-Eleven',
        'caption' => '只有在夏威夷或亞利桑納之類的地方才有真正的24小時商店，但他們也還是會在某些年出錯。',
        'height' => 356,
        'date' => '2017-4-17',
    ],
    1824 => [
        'title' => '辨識圖',
        'caption' => '小心，繁殖季節到了，這之中有些會 *非常* 強勢的守護自己的巢穴。',
        'height' => 374,
        'date' => '2017-4-14',
    ],
    1823 => [
        'title' => '最熱門的編輯器',
        'caption' => 'Elon Musk 終於把我從特斯拉的內部 repo 裡面踢掉了，因為我一直在送 PR 讓方向控制能支援 VIM 快速鍵。',
        'height' => 264,
        'date' => '2017-4-12',
    ],
    1818 => [
        'title' => '雷利散射',
        'caption' => '如果你問「為什麼葉子是綠色的」，通常答案會是「因為葉子裡面有葉綠素，葉綠素是綠色的」，然而「為什麼葉綠素會散射出綠光」本身也是個好問題。',
        'height' => 553,
        'date' => '2017-3-31',
    ],
    1815 => [
        'title' => '國旗',
        'caption' => '有個妥協法案被提出來，可以留下通知條，但至少要充電。',
        'height' => 385,
        'date' => '2017-3-24',
    ],
    1813 => [
        'title' => '嘔吐表情符號',
        'caption' => '我最喜歡的應該會是 U+1F609 U+1F93F 微笑嘔吐臉。',
        'height' => 323,
        'date' => '2017-3-20',
    ],
    1810 => [
        'title' => '聊天系統',
        'caption' => '我是 Instagram 使用者裡面，少數只透過 UNIX talk 連結的。',
        'height' => 537,
        'date' => '2017-3-13',
    ],
    1808 => [
        'title' => 'Hacking',
        'caption' => '裡面還包括了幾百萬個質數，電子雞的 0-day 漏洞，以及讓 gcc 以及 bash 執行任意程式碼的方法。',
        'height' => 400,
        'date' => '2017-3-8',
    ],
    1807 => [
        'title' => '竊聽',
        'caption' => '你當然可以直接問，不過這樣可以順便把禮物給解決掉。',
        'height' => 400,
        'date' => '2017-3-6',
    ],
    1806 => [
        'title' => '跟你借筆電',
        'caption' => '如果軟體跟得上的話，把滑鼠滾輪設定成「復原」跟「重做」應該很有趣。',
        'height' => 493,
        'date' => '2017-3-3',
    ],
    1804 => [
        'title' => '影片內容',
        'caption' => '「所以，像是，性感新聞影片這樣？」「不，那已經有人試過了，那還是影片內容。我們得透過打砲來傳遞新聞內容。我會把這個稱作『嘴上內容』，但我記得這好像是 Neil Cicierega 的專輯名稱。」',
        'height' => 358,
        'date' => '2017-2-27',
    ],
    1803 => [
        'title' => '地點評論',
        'caption' => 'Google 跟 Yelp 一直在刪除我對於馬里亞納海溝、車諾比爾反應爐心、噴射氣流、以及赤道的批判性評論。',
        'height' => 1015,
        'date' => '2017-2-24',
    ],
    1801 => [
        'title' => '選擇困難症',
        'caption' => '說得好，不做決定本身是也個決定，所以這是我該研究的第三個選項。',
        'height' => 385,
        'date' => '2017-2-20',
    ],
    1795 => [
        'title' => '吃到飽',
        'caption' => '在我的無心導致了嚴重的由廣告看板造成的胃痛之後，我理解到應該最後才處理做廣告看板的店面。',
        'height' => 219,
        'date' => '2017-2-6',
    ],
    1792 => [
        'title' => '鳥/飛機/超人',
        'caption' => '你可以在窗戶上貼上特製的半透明膜，避免鳥或超人意外飛進窗戶',
        'height' => 561,
        'date' => '2017-1-30',
    ],
    1791 => [
        'title' => '折射望遠鏡 vs 反射望遠鏡',
        'caption' => '反過來說，折射式望遠鏡的聚光能力較弱，所以不容易分辨出影子人或是邪神 Chernabog',
        'height' => 306,
        'date' => '2017-1-27',
    ],
    1790 => [
        'title' => '五月病',
        'caption' => '轉個九十度，所有的 effect 都是 side effect',
        'height' => 297,
        'comment' => '原文標題的「SAD」在 explainxkcd.com 有一些爭論。',
        'date' => '2017-1-25',
    ],
    1789 => [
        'title' => '電話號碼',
        'caption' => '簡訊應該是傳得到，不過太長的簡訊會被轉成語音信箱，我好像把語音信箱擋掉了。',
        'height' => 471,
        'date' => '2017-1-23',
    ],
    1788 => [
        'title' => '駁船',
        'caption' => '我的人生目標是將一艘駁船發射到空中，然後降落在 Elon Musk 的火箭上。',
        'height' => 404,
        'date' => '2017-1-20',
    ],
    1787 => [
        'title' => '語音指令',
        'caption' => 'Davork 句子乍看之下比較難發音，但研究指出這對聲帶壓力比較小。',
        'height' => 378,
        'date' => '2017-1-18',
    ],
    1786 => [
        'title' => '垃圾',
        'caption' => '而且裡面時間流逝的速度不太一樣，裡面大部分的垃圾已經分解掉幾百年了。我有想過看要不要去聯絡尤卡山，也許他們有興趣談合作。',
        'height' => 274,
        'date' => '2017-1-16',
    ],
    1785 => [
        'title' => 'Wifi',
        'caption' => '更右邊那塊的人能夠正常連上，不過能連上的理由跟「韌體」什麼的鬼東西有關',
        'height' => 317,
        'date' => '2017-1-13',
    ],
    1783 => [
        'title' => 'EMail',
        'caption' => 'Rob，不好意思現在才回信，你還有要去看瓦力首映場嗎？',
        'height' => 359,
        'date' => '2017-1-9',
    ],
    1782 => [
        'title' => '團隊通訊',
        'caption' => '2078:他終於宣布他從 screen + irssi 跳槽到 tmux + weechat',
        'height' => 299,
        'date' => '2017-1-6',
    ],
    1781 => [
        'title' => '古代神器',
        'caption' => '我沒想到你能只用離群值就做出整組資料',
        'height' => 351,
        'date' => '2017-1-4',
    ],
    1780 => [
        'title' => '家電維修',
        'caption' => '[拿著三相馬達]很明顯的，問題在於我原本拆下這顆馬達的加濕器已經壞了。',
        'height' => 270,
        'date' => '2017-1-2',
    ],
    1776 => [
        'title' => '麋鹿',
        'caption' => 'And then in a twinkling, a sound gave me pause / From the roof came the scratching of eight tarsal claws.',
        'height' => 249,
        'date' => '2016-12-23',
    ],
    1775 => [
        'title' => '學到的事情',
        'caption' => '猜猜看是誰兩隻大拇指受傷，在急診室待了一整夜，只因為試著去救一隻跑進停紅燈的車子底下，後來還爬到引擎室裡面的小貓？而且還要感謝抗生素讓他能保住兩隻大拇指？就是這傢伙（註：小貓沒事！）',
        'height' => 543,
        'date' => '2016-12-21',
    ],
    1773 => [
        'title' => '負能量',
        'caption' => '[Google搜尋]如何封鎖自家草坪',
        'height' => 227,
        'date' => '2016-12-16',
    ],
    1770 => [
        'title' => '改介面',
        'caption' => '我知道他們總是說這是永久性的更動，不過當他們聽到我們抱怨的多大聲之後，總是會有人找到方法把東西改回來。',
        'height' => 403,
        'date' => '2016-12-9',
    ],
    1769 => [
        'title' => '沒看過星際大戰',
        'caption' => '如果有人在問你那些奇怪的細節，你就說那是從絕地王子系列來的。裡面太多彼此衝突的亂七八糟東西，幾十年前大部分的 Expanded Universe/Legends 粉絲就集體選擇遺忘裡面的細節。',
        'height' => 489,
        'date' => '2016-12-7',
    ],
    1761 => [
        'title' => '牽拖',
        'caption' => '我敢說如果我對著我朋友大吼大叫把他們嚇得半死，我心情會變好',
        'height' => 215,
        'date' => '2016-11-18',
    ],
    1758 => [
        'title' => '天文物理',
        'caption' => '神經科學部門 / 格言：我發誓如果我聽到「鏡像神經元」這個詞的話我會翻桌',
        'height' => 314,
        'date' => '2016-11-11',
    ],
    1755 => [
        'title' => '舊時光',
        'caption' => 'Lot of drama in those days, including constant efforts to force the &quot;Reflections on Trusting Trust&quot; guy into retirement so we could stop being so paranoid about compilers.',
        'height' => 530,
        'date' => '2016-11-4',
    ],
    1741 => [
        'title' => '工作量',
        'caption' => '雖然是我自己想像的，但我對帶開關的電源線起火事件已經有*這麼*多意見了...',
        'height' => 447,
        'date' => '2016-10-3',
    ],
    1737 => [
        'title' => '資料中心規模',
        'caption' => '艾西莫夫（最後的問題）漫畫裡的AC是藉由把每個資料中心透過超空間相連而建立起來的，這能解釋一些事情。熵沒有被逆轉，他只是在宇宙終結時扔掉它然後重新買一個新的進來。',
        'height' => 294,
        'date' => '2016-9-23',
    ],
    1731 => [
        'title' => '錯了',
        'caption' => '啊，我剛想起有另外一件事情我是對的，像是這個...',
        'height' => 638,
        'date' => '2016-9-9',
    ],
    1730 => [
        'title' => '掩星板',
        'caption' => 'New Worlds 任務有在爭取掩星板的預算，不過因為 NASA 有贊助，所以很難用這招嚇到他們的望遠鏡操作人員。',
        'height' => 287,
        'date' => '2016-9-7',
    ],
    1728 => [
        'title' => 'Cron Mail',
        'caption' => '接招吧，我在系統上意外維護了十五年卻從來沒搞懂怎麼用的 1980 年代架構的鬼東西',
        'height' => 298,
        'date' => '2016-9-2',
    ],
    1727 => [
        'title' => '電腦數量',
        'caption' => '他們為了灌水，在年度報告中把伽利略上的備援系統算成好幾台電腦。但就算這樣他們的進度還是嚴重落後。',
        'height' => 311,
        'date' => '2016-8-31',
    ],
    1726 => [
        'title' => 'Unicode',
        'caption' => '我對於申請雷龍的表情符號 codepoint 的提案感到非常期待，這東西有潛力把好幾群脫離現實的書呆子扯進同一個巨大網路辯論中。',
        'height' => 461,
        'date' => '2016-8-29',
    ],
    1725 => [
        'title' => '線性回歸',
        'caption' => '95%的信心區間暗示龍索的狗也可能是貓，或者是茶壺。',
        'height' => 312,
        'date' => '2016-8-26',
    ],
    1723 => [
        'title' => '隕石判斷',
        'caption' => '點圖可以看到真正的隕石判斷流程圖。我覺得最有趣的部分是「有人看到他掉下來嗎？ 有 -> 那不是隕石」，他沒寫錯。',
        'height' => 213,
        'link' => 'http://meteorites.wustl.edu/check-list.htm',
        'date' => '2016-8-22',
    ],
    1722 => [
        'title' => 'Debugging',
        'caption' => '如果你 google 不到你眼前的錯誤訊息，那你很可能發現了馬丁之劍的線索。',
        'height' => 258,
        'date' => '2016-8-19',
    ],
    1720 => [
        'title' => '馬兒們',
        'caption' => '這台車的決策能力是馬匹的 240%，而產生的便便只有 30%。',
        'height' => 272,
        'date' => '2016-8-15',
    ],
    1716 => [
        'title' => '時間旅行理論',
        'caption' => '「對了，那個看起來很帥的眼鏡是什麼」「只是壞掉的 Google Glass」',
        'height' => 298,
        'date' => '2016-8-5',
    ],
    1715 => [
        'title' => '家事小技巧',
        'caption' => '如果想讓你的鞋子更舒適、不發臭、而且更耐久，可以試著在洗澡前把他們脫下來。',
        'height' => 247,
        'date' => '2016-8-3',
    ],
    1693 => [
        'title' => '氧化',
        'caption' => '冷靜一點，你的皮膚上本來就住著一大堆節肢動物，那幾隻只是大一點而已。',
        'height' => 297,
        'date' => '2016-6-13',
    ],
    1667 => [
        'title' => '演算法',
        'caption' => '在 2007 年發生過宗教分裂，當時有個擁護 OpenOffice 的教派複製了一份 Sunday.xlsx 並獨立維護了這個檔案幾個月，為了讓兩份衝突的行程能夠重新結合在一起，導致了新發明的誕生，在試算表的格子之中，出現了現代的版本控制系統。',
        'height' => 206,
        'date' => '2016-4-13',
    ],
    1660 => [
        'title' => '機長廣播',
        'caption' => '啊靠，你有付錢嗎？嘿，有人有付錢嗎？有的話能讓我借一下你的電話嗎？',
        'height' => 315,
        'date' => '2016-3-25',
    ],
    1659 => [
        'title' => '輪胎鞦韆',
        'caption' => '如果我們能找到其中一個輪胎掩埋場，那下次他來搶他的卡車的時候我們就能抽身讓他把車拿回去。',
        'height' => 530,
        'date' => '2016-3-23',
    ],
    1658 => [
        'title' => '估計時間',
        'caption' => '侯世達定律：你每花一分鐘思考侯世達定律，你就有一分鐘沒在工作，而且你永遠做不完！完～～蛋～～啦～～～！',
        'height' => 278,
        'date' => '2016-3-21',
    ],
    1657 => [
        'title' => '瘋狂',
        'caption' => '我在十本字典裡面找 "insanity"，沒有一本寫了類似的東西。DSM-4 裡面也沒提到。不過我會繼續找下去，搞不好 DSM-5 裡面會有！',
        'height' => 378,
        'date' => '2016-3-18',
    ],
    1656 => [
        'title' => '開始了',
        'caption' => '也可以試試看「矮額～」',
        'height' => 196,
        'date' => '2016-3-16',
    ],
    1654 => [
        'title' => '萬用安裝 script',
        'caption' => '失敗的時候通常不會有什麼問題，如果安裝了好幾個版本，那其中一個版本是正確版本的機會也會提高。（注意：建議加上「yes」指令跟「 2>/dev/null」）',
        'height' => 340,
        'comment' => '這篇好像沒什麼翻譯到...',
        'date' => '2016-3-11',
    ],
    1652 => [
        'title' => '條件判斷',
        'caption' => '「如果你執著夠了，我們來去吃晚餐」「你又來了」「我沒有！」',
        'height' => 380,
        'date' => '2016-3-7',
    ],
    1643 => [
        'title' => '溫度',
        'caption' => '「攝氏弳度還是華氏弳度？」「呃，不好意思，我先走了」',
        'height' => 284,
        'date' => '2016-2-15',
    ],
    1642 => [
        'title' => '重力波',
        'caption' => '最後一筆 Linkedin 連結請求創下了天文史上發射能量最強的紀錄，也許該回他一句「鼻要」',
        'height' => 284,
        'date' => '2016-2-11',
    ],
    1638 => [
        'title' => '反斜線們',
        'caption' => '我爬了一下我 .bash_history，看哪些指令有最多的特殊字元跟最少的英文字母，贏家是「cat out.txt | grep -o \'[[(].*[])][^)]]*$\'」...我不記得這是什麼也沒印象我原本想幹嘛，希望這行指令會動。',
        'height' => 207,
        'date' => '2016-2-2',
    ],
    1636 => [
        'title' => 'XKCD 架構',
        'caption' => '此網站需要 Sun Java 6.0.0.1 (32-bit) 或更高版本，您安裝了 Macromedia Java 7.3.8.1¾ (48-bit)。點此（連結到 java.com 首頁）可以下載安裝程式，雖然他會正常執行不過什麼都不會安裝。',
        'height' => 592,
        'date' => '2016-1-29',
    ],
    1633 => [
        'title' => '可能還沒發現的行星',
        'caption' => '超人在鳥跟飛機的邊界上，難怪有人會搞錯。',
        'height' => 697,
        'date' => '2016-1-22',
    ],
    1613 => [
        'title' => '機器人三定律',
        'caption' => '以第五個順序來說，自動駕駛車會很樂意載你到處走，但如果你要他們開到二手車行，他們會把門鎖起來，然後有禮貌的問你餓死人類要花多久時間。',
        'height' => 570,
        'date' => '2015-12-7',
    ],
    1606 => [
        'title' => '五日天氣預報',
        'caption' => '有句話是這樣說的：如果你不喜歡太陽系這裡的天氣，等個五十億年就好了。',
        'height' => 440,
        'date' => '2015-11-20',
    ],
    1604 => [
        'title' => '蛇',
        'caption' => '最後一條色環用來標示這條蛇被人抓起來之後能容忍到什麼程度而不咬人',
        'height' => 205,
        'date' => '2015-11-16',
    ],
    1601 => [
        'title' => '人際孤立',
        'caption' => '2060: 那些開心著彼此聊著自己怎麼離開電腦的超智慧AI已經變成了老古董。現在的量子超生物忙著做多重宇宙模擬，根本沒空發現他們自己是在電腦裡面！',
        'height' => 243,
        'date' => '2015-11-9',
    ],
    1597 => [
        'title' => 'GIT',
        'caption' => '如果沒用的話，打開 git.txt ，裡面那支電話可以找到我一個朋友他會用 GIT。他會先跟你講幾分鐘的「這很簡單，你就把 branch 想成是....」，之後他就會告訴你一段指令，那段指令能把東西修好。',
        'height' => 478,
        'date' => '2015-10-30',
    ],
    1570 => [
        'title' => '工程師的三段論證',
        'caption' => '不常見，但更糟糕的後果：「3:[所有在該金融系統裡面的人] 等等，我的錢跑去哪了？」',
        'height' => 263,
        'date' => '2015-8-28',
    ],
    1521 => [
        'title' => '石中劍',
        'caption' => '我只是覺得這劍很酷而已，哪有那麼麻煩的..',
        'height' => 184,
        'date' => '2015-5-6',
    ],
    1519 => [
        'title' => '金星',
        'caption' => '金星花卉突然進入地球，導致授粉動物的爆炸性成長。這稱為「蝴蝶效應」。',
        'height' => 271,
        'date' => '2015-5-1',
    ],
    1510 => [
        'title' => '拿破崙',
        'caption' => '「總統先生，如果發生了萬一該怎麼辦？萬一火箭發射失敗，拿破崙沒有被困在月球上？」「叫 William Safire 寫一篇演講稿」',
        'height' => 923,
        'date' => '2015-4-10',
    ],
    1505 => [
        'title' => '本體論證明',
        'caption' => '握有吃滑板世界紀錄的神，比起沒有該項紀錄的神更加的偉大。',
        'height' => 293,
        'date' => '2015-3-30',
    ],
    1504 => [
        'title' => '機遇號',
        'caption' => '我們都記得登上火星的太空人說過的名言：這是我的一小...靠腰那看起來像是個鑽頭，快點回...[無法分辨]...[信號中斷]',
        'height' => 278,
        'date' => '2015-3-27',
    ],
    1445 => [
        'title' => '效率',
        'caption' => '我的研究計畫延期，是因為我花了一個月研究 Dvorak 鍵盤會不會讓我打字比較快。',
        'height' => 214,
        'date' => '2014-11-10',
    ],
    1425 => [
        'title' => '工作項目',
        'caption' => '在 60 年代，Marvin Minsky 找來一批應屆畢業生叫他們花一個夏天來寫程式用攝影機判斷拍到的物體是什麼。他當時認為夏天結束之前他們就能解決問題。半個世紀之後我們還在繼續努力。',
        'height' => 448,
        'date' => '2014-9-24',
    ],
    1373 => [
        'title' => '螢幕截圖',
        'caption' => '我都插上充電線了但畫面看來沒在充電啊！',
        'height' => 511,
        'date' => '2014-5-26',
    ],
    1361 => [
        'title' => 'Google 的公告',
        'caption' => '比較不熱門的 8.8.4.4 也已經預定要終止',
        'height' => 383,
        'date' => '2014-4-28',
    ],
    1357 => [
        'title' => '言論自由',
        'caption' => '忘記是在哪裡聽到，但有人說過用言論自由來為立場辯護等於是最極端的讓步；這等於是說你說的話最有說服力的地方，在於說出來並不犯法。',
        'height' => 577,
        'date' => '2014-4-18',
    ],
    1342 => [
        'title' => '古代的星星',
        'caption' => '「那幾百萬顆星星發出的光芒可能已經有幾萬年了」是少數一般人會高估天文學數字的例子。',
        'height' => 243,
        'date' => '2014-3-14',
    ],
    1340 => [
        'title' => '獨特日期',
        'caption' => '如果我們的文明再持續個八千年，我想可以預期長遠當代基金會能搞定一切，然後我們會乖乖聽他們的話改用五碼年份。',
        'height' => 333,
        'date' => '2014-3-10',
    ],
    1338 => [
        'title' => '陸地哺乳動物',
        'caption' => '細菌的重量還是超過我們一千倍，這還沒算進人體內幾磅重的細菌。',
        'height' => 495,
        'date' => '2014-3-5',
    ],
    1329 => [
        'title' => '站立',
        'caption' => '我本來是要笑他們，結果被笑的是我。鹿其實還滿人體工學的，除了會踢人以外。',
        'height' => 246,
        'date' => '2014-2-12',
    ],
    1319 => [
        'title' => '自動化',
        'caption' => 'Automating 的字根 Auto- 意思是「自己」， mating 則是「搞」的意思',
        'height' => 408,
        'date' => '2014-1-20',
    ],
    1305 => [
        'title' => '隱藏功能',
        'caption' => '而且他也不會跳出對話方塊一直吵著要你的真實姓名。事實上你根本沒辦法設定你的名字，你得一直告訴別人你是誰。',
        'height' => 3238,
        'og' => [
            'image' => 'https://xkcd.tw/img/og_1305.jpg',
        ],
        'date' => '2013-12-18',
    ],
    1301 => [
        'title' => '副檔名',
        'caption' => '手動對齊過的 txt 檔案裡面的資料從來沒騙過我。',
        'height' => 332,
        'date' => '2013-12-9',
    ],
    1295 => [
        'title' => '新研究',
        'caption' => '當研究正式出版之後，沒人知道新聞還會不會去報導他們。',
        'height' => 345,
        'date' => '2013-11-25',
    ],
    1285 => [
        'title' => '第三種選擇',
        'caption' => '「等寬字型打字機的故事完全是假造的！醒醒吧！」「那不重要！研究支持只加一個空白！」「那些研究在統計上並不顯著！」「好，算你贏。我每一句後面都加兩個空白！」「不要，你的蠢空白好吵！」',
        'height' => 232,
        'date' => '2013-11-1',
    ],
    1268 => [
        'title' => '平行宇宙',
        'caption' => '我想我應該是在1990年代後期從 Earth Prime 被傳送過來的。你們的宇宙跟我的都一樣，除了那個龍蝦什麼的以外，還有你們某些地方的人有時候會為了某些理由改掉時鐘的時間。',
        'height' => 413,
        'date' => '2013-9-23',
    ],
    1244 => [
        'title' => '一句話',
        'caption' => '嚴格說起來，我們用的是 Orbiter',
        'height' => 397,
        'date' => '2013-7-29',
    ],
    1237 => [
        'title' => 'QR Code',
        'caption' => '注意，安裝程式會檢查相機的校驗碼，你必須用這支手機的相機掃描 QR Code。',
        'height' => 448,
        'date' => '2013-7-12',
    ],
    1236 => [
        'title' => '貝殼',
        'caption' => '這大約等於「我到海邊撿起貝殼的次數 / 我撿起貝殼的次數」，以我來說這個數字很接近 1 。如果只考慮我沒把貝殼放到耳朵旁邊的次數的話就更接近了。',
        'height' => 394,
        'date' => '2013-7-10',
    ],
    1235 => [
        'title' => '問題解決',
        'caption' => '好吧，我們只搞定那些會發出可見光、或是會移動東西、或是會發出聲音的鬼。不過這樣就包含魔鬼剋星裡面全部的鬼了，我想這樣應該夠了。',
        'height' => 214,
        'date' => '2013-7-8',
    ],
    1233 => [
        'title' => '相對性',
        'caption' => '一般認為勞倫茲變換會讓物體在移動方向變得扁平，然而這並沒有考慮到光本身的移動時間。事實上，快速移動的屁屁看起來會像在旋轉接近觀察者，但不會大幅度的變形。夏奇拉是對的。',
        'height' => 350,
        'comment' => 'Gedankedank 我實在不知道怎麼翻譯...',
        'date' => '2013-7-3',
    ],
    1232 => [
        'title' => '實際條件',
        'caption' => '我猜要十五年，要解決的問題真的滿多的',
        'height' => 371,
        'date' => '2013-7-1',
    ],
    1229 => [
        'title' => '螢幕保護程式',
        'caption' => '這是我第二十四年每晚花八小時用獵鴨的光束槍去打那些會飛的烤麵包機，總有一天我會打下一台。',
        'height' => 1319,
        'date' => '2013-6-24',
    ],
    1228 => [
        'title' => '普羅米修斯',
        'caption' => '如果有部麥克貝電影是全世界軍隊由於種種原因集結在一起對抗人類的傳說故事，而你是個戰機駕駛，正好突破防線要對奧林帕斯山發射飛彈，這時「我來還普羅米修斯偷走的東西」感覺會是句好台詞。',
        'height' => 380,
        'date' => '2013-6-21',
    ],
    1224 => [
        'title' => '三百人議會',
        'caption' => '「然後催眠某個人，讓他以為自己上傳了影片。」「可是上傳者不會覺得數字卡在 301+ 一陣子很奇怪嗎？為什麼我們不直接假造播放次...」（哐噹）「299人議會休會」',
        'height' => 261,
        'date' => '2013-6-12',
    ],
    1223 => [
        'title' => '矮人要塞',
        'caption' => '我也許是那種會浪費一年時間在矮人要塞裡面做出圖靈完備的電腦的人，但這代表你會花十倍的時間讓那台電腦在 Minecraft 裡面跑起來。',
        'height' => 480,
        'date' => '2013-6-10',
    ],
    1218 => [
        'title' => '都靈之門',
        'caption' => '如果我們把門都打開，然後堵住西瓦南河的水壩讓水位稍微上升，池水應該會淹入摩瑞亞。你覺得水中監視者跟濕搭搭的炎魔打起來會變成怎樣？',
        'height' => 239,
        'date' => '2013-5-29',
    ],
    1217 => [
        'title' => '細胞',
        'caption' => '如果他說在培養皿裡面會選擇性地殺死癌細胞，這對所有培養皿癌的患者來說會是重大的突破。',
        'height' => 339,
        'date' => '2013-5-27',
    ],
    1203 => [
        'title' => '時光機',
        'caption' => '系統正常，倒數十秒...十一秒...',
        'height' => 274,
        'date' => '2013-4-24',
    ],
    1200 => [
        'title' => '授權',
        'caption' => '你先別說話，不，我才不會登入帳號以後離開我的筆電趴趴走。而且我有設定在幾分鐘沒有動作之後自動切換到我哥的帳號。',
        'height' => 342,
        'date' => '2013-4-17',
    ],
    1199 => [
        'title' => '沈默',
        'caption' => '所有的音樂都是 4\'33"，只是剛好旁邊有其他樂團在演奏。',
        'height' => 235,
        'date' => '2013-4-15',
    ],
    1197 => [
        'title' => '所有的ADOBE更新',
        'caption' => '警告：一部分的相依軟體更新需要 21.1.2 版的 Oracle/Sun Java(TM) JDK(TM) 更新程式執行環境資料更新程式，這在您的系統上無法取得。',
        'height' => 408,
        'date' => '2013-4-10',
    ],
    1179 => [
        'title' => 'ISO 8601',
        'caption' => 'ISO 8601 是在 06/05/88 出版，最近一次修訂是 12/01/04',
        'height' => 456,
        'date' => '2013-2-27',
    ],
    1174 => [
        'title' => 'APP',
        'caption' => '我按下 No 的時候大概表示我已經放棄了。所以別再把我轉址到剛剛我原本想打開的那頁了，帶我回首頁吧。',
        'height' => 411,
        'date' => '2013-2-15',
    ],
    1168 => [
        'title' => 'TAR',
        'caption' => '不知道哪一點比較糟：用了十五年我依然沒辦法直接記住 tar 的 flag 要怎麼下，或是在十五年的科技進步之後我還是得搞這些當年就已經十五歲的 tar flag',
        'height' => 229,
        'date' => '2013-2-1',
    ],
    1162 => [
        'title' => '對數刻度',
        'caption' => '高德納紙堆表示法：在紙上寫下該數字，把紙張堆起來。如果堆得太高房間塞不下，寫下寫這個數字需要的頁數。現在這個數字還是塞不進房間裡面的話，重複一次。當紙堆可以塞進房間的時候，在卡片上寫下剛剛的動作重複做了幾次，然後把卡片釘在紙堆上。',
        'height' => 400,
        'date' => '2013-1-18',
    ],
    1144 => [
        'title' => '標籤',
        'caption' => '<A>:像是</a>這樣。&nbsp;',
        'height' => 57,
        'date' => '2012-12-7',
    ],
    1109 => [
        'title' => '冰箱',
        'caption' => '這應該刻在我的墓碑上，就像西蒙·斯蒂文的墓誌銘那樣。',
        'height' => 405,
        'date' => '2012-9-17',
    ],
    1098 => [
        'title' => '五星評分',
        'caption' => '我不小心迷路走進全世界最嚇人的葬禮，墓碑上面只有名字跟五星評分。我嚇死了。我回到家以後想要在 Yelp 上面寫一篇壞的評論文，但當我的游標移到「一顆星」的按鈕上面時，我感到一陣惡寒...',
        'height' => 310,
        'date' => '2012-8-22',
    ],
    1053 => [
        'title' => '一萬',
        'caption' => '比起說「哪個白癡不知道黃石公園的超級火山」，告訴人家有黃石公園超級火山這件事要有趣多了。',
        'height' => 316,
        'date' => '2012-5-9',
    ],
    1022 => [
        'title' => '看來事已至此',
        'caption' => '「至什麼此？」「你，我，在這一刻」',
        'height' => 420,
        'date' => '2012-2-27',
    ],
    979 => [
        'title' => '前人的智慧',
        'caption' => '很長的求救文應該要讓討論串的第一篇可以被任何人編輯，開頭是「來自未來的各位，我們現在的進度是...',
        'height' => 274,
        'date' => '2011-11-18',
    ],
    978 => [
        'title' => '創造引用來源',
        'caption' => '我讀過一本受人敬重的作者寫的科普書，其中有一章，裡面大部分的假說是根基於不準確的資料，來源是...維基百科。為了讓大家提高警覺心，我不會說是哪本書或哪個作者。',
        'height' => 614,
        'date' => '2011-11-16',
    ],
    965 => [
        'title' => '元素之力',
        'caption' => '在各國之中，操縱 Uuo 的大概是最不嚇人的。操縱氙的只好人家一點，不過至少他們的霓虹燈閃閃爍爍很有宣傳效果。',
        'height' => 452,
        'date' => '2011-10-17',
    ],
    961 => [
        'title' => '永恆之火',
        'caption' => '懷抱希望，只要等得夠久，說不定海灘球就會消失，卡住的畫面會回來。',
        'img_url' => '/strip/961.gif',
        'height' => 223,
        'date' => '2011-10-6',
    ],
    936 => [
        'title' => '密碼安全性',
        'caption' => '對於那些理解資訊安全以及資訊理論，而且正在跟不懂的人戰的人，我誠摯的道歉。',
        'height' => 601,
        'date' => '2011-8-10',
    ],
    932 => [
        'title' => 'CIA',
        'caption' => '那是他們的主要徵才海報，掛在牆上接近三公尺高的地方！換句話說駭客有「梯子」這種技術！未來我們是否每個人都要為了壓克力做的海報護套付出50美金的代價呢？廣告之後我們繼續...',
        'height' => 263,
        'date' => '2011-8-1',
    ],
    927 => [
        'title' => '標準規範',
        'caption' => '還好，充電的標準已經統一成大家全部用 mini-USB。等等是 micro-USB？ 靠腰..',
        'height' => 283,
        'date' => '2011-7-20',
    ],
    862 => [
        'title' => '放手',
        'caption' => '經過許多年，試了各種方法，我藉由讓我的缺乏耐心跟我的懶惰彼此競爭消滅了這個習慣。我將這個行為與精神上的愉悅斷開連結的方式是設定我自己在載入任何新頁面或是聊天軟體前必須要等待三十秒，這段時間我什麼事都不能做，而且我一次只能開一個。然後我想要檢查這些網站的慾望神奇的消失了，而我「有產出」的電腦使用則不受影響。',
        'height' => 237,
        'date' => '2011-2-18',
    ],
    837 => [
        'title' => '優惠代碼',
        'caption' => '這組代碼也保證不會讓你收到山貓。',
        'height' => 237,
        'date' => '2010-12-22',
    ],
    833 => [
        'title' => '有說服力',
        'caption' => '而且如果你有把座標軸標清楚，我還能告訴你實際上是有多好。',
        'height' => 237,
        'date' => '2010-12-13',
    ],
    787 => [
        'title' => '軌道載具',
        'caption' => '正常來說，從卡納維爾角發射的太空梭不太能安全的抵達能到達這幾個點的軌道。不過這篇是平行世界，要嘛是太空梭從范登堡空軍基地發射，要嘛是大家很討厭外灘群島。',
        'height' => 345,
        'date' => '2010-9-1',
    ],
    773 => [
        'title' => '大學網站',
        'caption' => '人們會去這些網站是因為他們等不及想看下一期的校友雜誌對吧？什麼？你說要校園地圖？我們有個 CS 學生在 2001 做了個專案，你可以點選然後縮放上面的所有東西喔！',
        'height' => 378,
        'date' => '2010-7-30',
    ],
    763 => [
        'title' => 'Workaround',
        'caption' => '我曾經處理過某個朋友爸爸的電腦，他的硬碟被分成六個 partition，從 C: 到 J:，每個槽都有一個「Documents」資料夾，檔案好像是隨機存到六個槽裡面的其中一個。我知道這時候什麼都不要問。',
        'height' => 462,
        'date' => '2010-7-7',
    ],
    724 => [
        'title' => '地獄',
        'caption' => '另外還有個塊魂裡面東西都只比你大一點，還有個瑪力歐的無敵星星在你剛好吃不到的地方。',
        'height' => 476,
        'date' => '2010-4-7',
    ],
    697 => [
        'title' => '拉伸強度 vs 剪切強度',
        'caption' => '雖然實際上，傷害是在派對主辦人在電梯的纜線上打洞來掛旗子的時候造成的。',
        'height' => 604,
        'date' => '2010-2-3',
    ],
    695 => [
        'title' => '精神號',
        'caption' => '2010年1月26日，任務的第 2274 個火星日，NASA 宣布精神號無法移動轉為固定式研究站，預計數個月後就會因為太陽能板被塵埃覆蓋，電力不足而必須關閉。',
        'height' => 862,
        'date' => '2010-1-29',
    ],
    683 => [
        'title' => '科學畫面',
        'caption' => '那隻老鼠看來很不安，他一定是感應到了奈米機器人！灰色警戒，我們面臨了 Helvetica 事件！',
        'height' => 865,
        'date' => '2010-1-1',
    ],
    670 => [
        'title' => 'Spinal Tap 的放大器',
        'caption' => '哇喔，每...呃...還不用 200，真划算！',
        'height' => 237,
        'date' => '2009-12-2',
    ],
    664 => [
        'title' => '學術界 vs 商業界',
        'caption' => '有工程師已經解決了 P=NP 問題，答案被鎖在某個打蛋器校正程式裡面。我們每發現一個 0x5f375a86，背後有數千個沒有被發現的。',
        'height' => 382,
        'date' => '2009-11-18',
    ],
    630 => [
        'title' => '時間旅行',
        'caption' => '他每一封信的開頭都會寫「親愛的未來的 <你的名字>」',
        'height' => 298,
        'date' => '2009-8-31',
    ],
    627 => [
        'title' => '技術支援流程圖',
        'caption' => '乖女兒，我是你爸，要怎麼列印流程圖啊？',
        'height' => 823,
        'date' => '2009-8-24',
    ],
    619 => [
        'title' => '功能支援',
        'caption' => '我知道有些人已經有平滑 flash 影片支援，不過我跟我的 Intel 顯示卡還在等開發流程中的某個 kernel patch，不然我們只能看到格子狀的喬恩·史都華',
        'height' => 326,
        'date' => '2009-8-5',
    ],
    612 => [
        'title' => '時間估計',
        'caption' => '他們可以直接說「連線似乎已中斷」，但是直接把時間做平均會比較有趣，讓你滿懷希望的覺得你只要多等個 1163 小時他就會跑完。',
        'height' => 335,
        'date' => '2009-7-20',
    ],
    600 => [
        'title' => '機器男友',
        'caption' => '這正好是我家裡面讓人最不舒服的壁爐裝飾。',
        'height' => 220,
        'date' => '2009-6-22',
    ],
    503 => [
        'title' => '用詞',
        'caption' => '然後，是只有我這麼覺得，還是日本跟紐西蘭看起來超像的？有人看過他們兩個同時出現嗎？',
        'height' => 348,
        'date' => '2008-11-12',
    ],
    487 => [
        'title' => '數字體位',
        'caption' => '我們還沒做到連分數呢',
        'height' => 511,
        'date' => '2008-10-10',
    ],
    457 => [
        'title' => '挫折',
        'caption' => '「別擔心，我花不到一分鐘就能解決」「是的，我注意到了」',
        'img_url' => '/strip/457.png',
        'height' => 279,
        'date' => '2008-8-1',
    ],
    456 => [
        'title' => '警告',
        'caption' => '這是個真實故事，當事人不知道我把這個畫成漫畫是因為他的 Wifi 壞了好幾個禮拜',
        'height' => 277,
        'date' => '2008-7-30',
    ],
    444 => [
        'title' => '懶惰馬蓋先',
        'caption' => '馬蓋先維基上有篇文章，標題是「List of problems solved by MacGyver」',
        'height' => 248,
        'date' => '2008-7-2',
    ],
    393 => [
        'title' => '終極遊戲',
        'caption' => '安息吧，Gary',
        'height' => 188,
        'date' => '2008-3-7',
    ],
    387 => [
        'title' => '先進技術',
        'caption' => '我們是性感的馮紐曼機器',
        'height' => 244,
        'date' => '2008-2-22',
    ],
    378 => [
        'title' => '真正的程式設計師',
        'caption' => '真正的程式設計師會設定好宇宙常數，讓宇宙演化成裡面會有一顆內含需要的資料的硬碟。',
        'height' => 406,
        'date' => '2008-2-1',
    ],
    355 => [
        'title' => '一對',
        'caption' => '臉書定義了人際關係。「我們本來昨晚會分手的，但是網路連不上」',
        'height' => 160,
        'date' => '2007-12-10',
    ],
    353 => [
        'title' => 'Python',
        'caption' => '我昨晚寫了 20 支 Python 小程式，這玩意兒太棒了。再見了 Perl。',
        'height' => 588,
        'comment' => '在 Python 裡面 import antigravity 真的有用，真的。',
        'date' => '2007-12-5',
    ],
    349 => [
        'title' => '成功',
        'caption' => '安裝 OpenBSD 有 40% 的機率導致鯊魚攻擊，這是他們唯一的安全性問題。',
        'height' => 947,
        'date' => '2007-11-26',
    ],
    327 => [
        'title' => '媽咪攻擊',
        'caption' => '她女兒的名字是「救命！我被困在駕照工廠裡面！」',
        'height' => 205,
        'date' => '2007-10-10',
    ],
    323 => [
        'title' => '鮑爾默高點',
        'caption' => 'Apple 靠的是自動化杜松子酒靜脈注射。',
        'height' => 592,
        'date' => '2007-10-1',
    ],
    319 => [
        'title' => '工程傲慢',
        'caption' => '查克·瓊斯是個易怒的神',
        'height' => 212,
        'date' => '2007-9-21',
    ],
    308 => [
        'title' => '特別的人生',
        'caption' => '快，用 cat-6 的線做成登山背帶，跟我一起下去。',
        'height' => 421,
        'date' => '2007-8-27',
    ],
    305 => [
        'title' => '第 34 條法則',
        'caption' => 'Lance，想進入大學盃比賽的話，試著拼 "Throbbing" 這個字。',
        'height' => 360,
        'date' => '2007-8-20',
    ],
    303 => [
        'title' => '編譯中',
        'caption' => '「你在偷 LCD 嗎？」「對，不過我是趁 code 還在編譯的時候偷的」',
        'height' => 360,
        'date' => '2007-8-15',
    ],
    285 => [
        'title' => '抗議的維基人',
        'caption' => '憲法已被半保護',
        'height' => 271,
        'date' => '2007-7-4',
    ],
    246 => [
        'title' => '迷宮問題',
        'caption' => '這只是用來抓那些跑掉的邏輯學家的，其實每道門都出不去。',
        'height' => 455,
        'date' => '2007-4-9',
    ],
    245 => [
        'title' => '地磚',
        'caption' => '最麻煩的是當人行道地磚的裂縫跟你的自然步伐不同步的時候。',
        'height' => 192,
        'transcript' => '[[兩個人走在黑白相間的地磚上]]

第一個人：你為什麼要走的很奇怪？

[[第二格是第二個人腦內的忘想畫面，他拿著指示棒指著一張圖表，上面有地磚的花紋]]
第二個人想著：嗯，我本來直覺是想要踩在黑地磚上，但是他們距離太遠了，所以我讓自己踩在黑地磚直線範圍的磚塊上。但這表示當我們斜著走的時候，我走的路徑模式會變成....

[[回到第一格的狀況]]
第二個人：我沒有走的很奇怪

{{最麻煩的是當人行道地磚的裂縫跟你的自然步伐不同步的時候}}',
        'date' => '2007-4-6',
    ],
    244 => [
        'title' => '桌上角色扮演',
        'caption' => '我好像有把兩隻傳送戒指的其中一隻丟進海底過，結果滿有趣的',
        'height' => 454,
        'transcript' => '[[四個人坐在桌邊]]

DM：你的隊伍進了酒館
玩家：我在桌子旁邊召集所有人。我讓妖精開始削骰子，然後拿出幾張蠟紙當角色單來用
DM：嘿，不可以遞迴啦

{{我好像有把兩隻傳送戒指的其中一隻丟進海底過，結果滿有趣的}}',
        'date' => '2007-4-4',
    ],
    236 => [
        'title' => '蒐集人的想法',
        'caption' => '遊戲：找出哪兩種東西擺在一起結帳會讓收銀員最驚慌失措。贏家：懷孕試劑跟單勾壁勾。',
        'height' => 447,
        'transcript' => '[[男人站在超市商品走道的中央，一手拿著一條 KY，另一手托著下巴。從左到右的商品標示分別是「香蕉」「頻果」「橘子」「美國南瓜」]]

我的興趣：拿著一條 KY 站在超市的農產品區，做出沈思的樣子

{{遊戲：找出哪兩種東西擺在一起結帳會讓收銀員最驚慌失措。贏家：懷孕試劑跟單勾壁勾。}}',
        'date' => '2007-3-16',
    ],
    231 => [
        'title' => '人貓距離',
        'caption' => '是耶！你坐在那裡耶！你好啊，小貓咪！',
        'height' => 439,
        'transcript' => '[[畫了一張圖表，X軸：「人與貓的距離」 從遠到近]]
[[一條向下彎曲的曲線，標示為智力]]
[[一條向上彎曲的曲線，標示為發言的愚蠢程度]]

[[男人站得離貓很遠]]
[[男人站得離貓近一點]]
[[男人站在貓旁邊]]
男人：是小貓咪耶!

{{ 是耶！你坐在那裡耶！你好啊，小貓咪！ }}',
        'date' => '2007-3-5',
    ],
    208 => [
        'title' => '正規表示式',
        'caption' => '等等，少跳脫一個空白，咿～～～[敲敲敲]～～～',
        'height' => 607,
        'transcript' => '旁白：每一次我學到新技術，我都會認真的幻想出我帥氣的運用這些技術的情節
女：噢不，殺手一定是趁他在度假的時候去跟蹤他了！

[[女人指著電腦]]
女：但是要找到他們，我們得在200MB 的電子郵件中找出格式看起來像是地址的東西！
男：這下沒轍了！

畫面外的聲音：大家退後一點
畫面外的聲音：我會正規表示式

[[男人盪著繩索到電腦前面]]
<<敲敲>>
<<PERL!>>

[[男人盪著繩索離開現場，其他人歡呼]]

{{ 等等，少跳脫一個空白，咿～～～[敲敲敲]～～～ }}',
        'date' => '2007-1-10',
    ],
    202 => [
        'title' => 'Youtube',
        'caption' => 'I pray GunPistolMan never learns the word \'sheeple\'',
        'height' => 860,
        'transcript' => '網路一直都有很多說話大聲的白痴，不過在 Youtube 影片上回應的人真的是有夠出類拔萃，其他地方沒得比
[[登月影片的 Youtube 回應頁面]]
回應與評論

rocckir (48 分鐘前)
這也太假了，為什麼有人會信啊？傻了嗎？

bigmike133 (35 分鐘前)
我看過太空梭的屁股，那個絕對在月球登陸過，讀點書好嗎？

gunpistolman (22 分鐘前)
如果那樣的話，那為什麼惠有重力？美國人都是小笨羊

crackmonkey74 (17 分鐘前)
你覺得我們沒上過月球？有膽就去找路易士阿姆斯壯啊

simpleplan2009 (3 分鐘前)
那是火星上的佈景

{{ I pray GunPistolMan never learns the word \'sheeple\'. }}',
        'date' => '2006-12-27',
    ],
    149 => [
        'title' => '三明治',
        'caption' => '設定帳號權限跟「老師說」是一樣的意思',
        'height' => 299,
        'transcript' => '[[一個男人坐在沙發上，跟另一個男人說話]]
男一：幫我做三明治
男二：不要，你自己去做
男一：sudo 幫我做三明治
男二：好',
        'date' => '2006-8-28',
    ],
    84 => [
        'title' => '國家語言',
        'caption' => '她被激怒的時候還滿尖銳的。',
        'height' => 428,
        'transcript' => '我朋友身上發生過這件事
[[一排男女]]
男：英文應該要是法定國家語言。移民進來的時候都應該要學英文
女：對啊
男：你去一個地方居住就應該學習那個地方的語言
女二：不好意思啊，但是 osio sarah dawado
男：剛剛那是啥鬼？
女二：查拉幾語
{{她被激怒的時候還滿尖銳的。}}',
        'date' => '2006-4-3',
    ],
    31 => [
        'title' => '桶子之五',
        'caption' => 'Too good not to happen.',
        'height' => 715,
        'date' => '2006-1-1',
    ],
    25 => [
        'title' => '桶子之四',
        'caption' => ':(',
        'height' => 433,
        'date' => '2006-1-1',
    ],
    22 => [
        'title' => '桶子之三',
        'caption' => '是漩渦！',
        'height' => 252,
        'date' => '2006-1-1',
    ],
    20 => [
        'title' => '雪貂',
        'caption' => '我的弟弟有隻雪貂，我畫完這篇之後死掉了。RIP。',
        'height' => 1307,
        'date' => '2006-1-1',
    ],
    11 => [
        'title' => '桶子之二',
        'caption' => '啊啊啊',
        'height' => 488,
        'date' => '2006-1-1',
    ],
    1 => [
        'title' => '桶子之一',
        'caption' => '我們都一樣',
        'height' => 311,
        'transcript' => '[[男孩坐在大海中央的桶子裡]]
男孩：不知道我會飄到哪裡？
[[桶子越飄越遠，看不到其他東西]]
{{我們都一樣}}',
        'date' => '2006-1-1',
    ],
];